ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc1_ccu4_map.h
#if (UC_DEVICE == XMC1100) && (UC_PACKAGE == VQFN40)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#endif


#if (UC_DEVICE == XMC1100) && (UC_PACKAGE == TSSOP16)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#endif


#if (UC_DEVICE == XMC1100) && (UC_PACKAGE == TSSOP38)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#endif


#if (UC_DEVICE == XMC1200) && (UC_PACKAGE == TSSOP38)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_LEDTSledts_SR0           	11
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_LEDTSledts_SR0           	11
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#endif


#if (UC_DEVICE == XMC1201) && (UC_PACKAGE == VQFN40)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_LEDTSledts_SR0           	11
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_LEDTSledts_SR0           	11
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#endif


#if (UC_DEVICE == XMC1201) && (UC_PACKAGE == TSSOP28)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_LEDTSledts_SR0           	11
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_LEDTSledts_SR0           	11
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#endif


#if (UC_DEVICE == XMC1201) && (UC_PACKAGE == TSSOP38)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_LEDTSledts_SR0           	11
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_LEDTSledts_SR0           	11
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#endif


