ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc1_ccu4_map.h
#if (UC_DEVICE == XMC1403) && (UC_PACKAGE == VQFN40)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_SR0                	27
#define CCU40_IN0_CCU40_SR2                	19
#define CCU40_IN0_CCU40_ST0                	20
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_ERU1_IOUT0               	23
#define CCU40_IN0_ERU1_PDOUT0              	22
#define CCU40_IN0_ERU1_PDOUT1              	24
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_SR1                	27
#define CCU40_IN1_CCU40_SR2                	19
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST1                	20
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_ERU1_IOUT1               	23
#define CCU40_IN1_ERU1_PDOUT0              	24
#define CCU40_IN1_ERU1_PDOUT1              	22
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_SR1                	19
#define CCU40_IN2_CCU40_SR2                	27
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST2                	20
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_ERU1_IOUT2               	23
#define CCU40_IN2_ERU1_PDOUT2              	22
#define CCU40_IN2_ERU1_PDOUT3              	24
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_SR1                	19
#define CCU40_IN3_CCU40_SR3                	27
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_CCU40_ST3                	20
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_ERU1_IOUT3               	23
#define CCU40_IN3_ERU1_PDOUT2              	24
#define CCU40_IN3_ERU1_PDOUT3              	22
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#define CCU41_IN0_CCU41_GP01               	12
#define CCU41_IN0_CCU41_SR0                	27
#define CCU41_IN0_CCU41_SR2                	19
#define CCU41_IN0_CCU41_ST0                	20
#define CCU41_IN0_CCU41_ST1                	13
#define CCU41_IN0_CCU41_ST2                	14
#define CCU41_IN0_CCU41_ST3                	15
#define CCU41_IN0_ERU0_IOUT0               	10
#define CCU41_IN0_ERU0_PDOUT0              	9
#define CCU41_IN0_ERU0_PDOUT1              	3
#define CCU41_IN0_ERU1_IOUT0               	23
#define CCU41_IN0_ERU1_PDOUT0              	22
#define CCU41_IN0_ERU1_PDOUT1              	24
#define CCU41_IN0_P0_4                     	1
#define CCU41_IN0_SCU_GSC40                	8
#define CCU41_IN0_U1C0_DX2INS              	28
#define CCU41_IN1_CCU40_ST1                	11
#define CCU41_IN1_CCU41_GP02               	12
#define CCU41_IN1_CCU41_SR1                	27
#define CCU41_IN1_CCU41_SR2                	19
#define CCU41_IN1_CCU41_ST0                	13
#define CCU41_IN1_CCU41_ST1                	20
#define CCU41_IN1_CCU41_ST2                	14
#define CCU41_IN1_CCU41_ST3                	15
#define CCU41_IN1_ERU0_IOUT1               	10
#define CCU41_IN1_ERU0_PDOUT0              	3
#define CCU41_IN1_ERU0_PDOUT1              	9
#define CCU41_IN1_ERU1_IOUT1               	23
#define CCU41_IN1_ERU1_PDOUT0              	24
#define CCU41_IN1_ERU1_PDOUT1              	22
#define CCU41_IN1_P0_5                     	1
#define CCU41_IN1_SCU_GSC40                	8
#define CCU41_IN1_U1C1_DX2INS              	28
#define CCU41_IN2_CCU40_ST2                	11
#define CCU41_IN2_CCU41_GP03               	12
#define CCU41_IN2_CCU41_SR1                	19
#define CCU41_IN2_CCU41_SR2                	27
#define CCU41_IN2_CCU41_ST0                	13
#define CCU41_IN2_CCU41_ST1                	14
#define CCU41_IN2_CCU41_ST2                	20
#define CCU41_IN2_CCU41_ST3                	15
#define CCU41_IN2_ERU0_IOUT2               	10
#define CCU41_IN2_ERU0_PDOUT2              	9
#define CCU41_IN2_ERU0_PDOUT3              	3
#define CCU41_IN2_ERU1_IOUT2               	23
#define CCU41_IN2_ERU1_PDOUT2              	22
#define CCU41_IN2_ERU1_PDOUT3              	24
#define CCU41_IN2_P0_6                     	1
#define CCU41_IN2_SCU_GSC40                	8
#define CCU41_IN3_CCU40_ST3                	11
#define CCU41_IN3_CCU41_SR1                	19
#define CCU41_IN3_CCU41_SR3                	27
#define CCU41_IN3_CCU41_ST0                	13
#define CCU41_IN3_CCU41_ST1                	14
#define CCU41_IN3_CCU41_ST2                	15
#define CCU41_IN3_CCU41_ST3                	20
#define CCU41_IN3_ERU0_IOUT3               	10
#define CCU41_IN3_ERU0_PDOUT2              	3
#define CCU41_IN3_ERU0_PDOUT3              	9
#define CCU41_IN3_ERU1_IOUT3               	23
#define CCU41_IN3_ERU1_PDOUT2              	24
#define CCU41_IN3_ERU1_PDOUT3              	22
#define CCU41_IN3_P0_7                     	1
#define CCU41_IN3_SCU_GSC40                	8
#define CCU41_IN3_VADC0_G0ARBCNT           	6
#endif


#if (UC_DEVICE == XMC1403) && (UC_PACKAGE == VQFN48)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_SR0                	27
#define CCU40_IN0_CCU40_SR2                	19
#define CCU40_IN0_CCU40_ST0                	20
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_ERU1_IOUT0               	23
#define CCU40_IN0_ERU1_PDOUT0              	22
#define CCU40_IN0_ERU1_PDOUT1              	24
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_P4_0                     	26
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_SR1                	27
#define CCU40_IN1_CCU40_SR2                	19
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST1                	20
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_ERU1_IOUT1               	23
#define CCU40_IN1_ERU1_PDOUT0              	24
#define CCU40_IN1_ERU1_PDOUT1              	22
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_SR1                	19
#define CCU40_IN2_CCU40_SR2                	27
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST2                	20
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_ERU1_IOUT2               	23
#define CCU40_IN2_ERU1_PDOUT2              	22
#define CCU40_IN2_ERU1_PDOUT3              	24
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_SR1                	19
#define CCU40_IN3_CCU40_SR3                	27
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_CCU40_ST3                	20
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_ERU1_IOUT3               	23
#define CCU40_IN3_ERU1_PDOUT2              	24
#define CCU40_IN3_ERU1_PDOUT3              	22
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#define CCU41_IN0_CCU41_GP01               	12
#define CCU41_IN0_CCU41_SR0                	27
#define CCU41_IN0_CCU41_SR2                	19
#define CCU41_IN0_CCU41_ST0                	20
#define CCU41_IN0_CCU41_ST1                	13
#define CCU41_IN0_CCU41_ST2                	14
#define CCU41_IN0_CCU41_ST3                	15
#define CCU41_IN0_ERU0_IOUT0               	10
#define CCU41_IN0_ERU0_PDOUT0              	9
#define CCU41_IN0_ERU0_PDOUT1              	3
#define CCU41_IN0_ERU1_IOUT0               	23
#define CCU41_IN0_ERU1_PDOUT0              	22
#define CCU41_IN0_ERU1_PDOUT1              	24
#define CCU41_IN0_P0_4                     	1
#define CCU41_IN0_P3_0                     	0
#define CCU41_IN0_P4_4                     	21
#define CCU41_IN0_SCU_GSC40                	8
#define CCU41_IN0_U1C0_DX2INS              	28
#define CCU41_IN1_CCU40_ST1                	11
#define CCU41_IN1_CCU41_GP02               	12
#define CCU41_IN1_CCU41_SR1                	27
#define CCU41_IN1_CCU41_SR2                	19
#define CCU41_IN1_CCU41_ST0                	13
#define CCU41_IN1_CCU41_ST1                	20
#define CCU41_IN1_CCU41_ST2                	14
#define CCU41_IN1_CCU41_ST3                	15
#define CCU41_IN1_ERU0_IOUT1               	10
#define CCU41_IN1_ERU0_PDOUT0              	3
#define CCU41_IN1_ERU0_PDOUT1              	9
#define CCU41_IN1_ERU1_IOUT1               	23
#define CCU41_IN1_ERU1_PDOUT0              	24
#define CCU41_IN1_ERU1_PDOUT1              	22
#define CCU41_IN1_P0_5                     	1
#define CCU41_IN1_P3_0                     	0
#define CCU41_IN1_P4_5                     	21
#define CCU41_IN1_SCU_GSC40                	8
#define CCU41_IN1_U1C1_DX2INS              	28
#define CCU41_IN2_CCU40_ST2                	11
#define CCU41_IN2_CCU41_GP03               	12
#define CCU41_IN2_CCU41_SR1                	19
#define CCU41_IN2_CCU41_SR2                	27
#define CCU41_IN2_CCU41_ST0                	13
#define CCU41_IN2_CCU41_ST1                	14
#define CCU41_IN2_CCU41_ST2                	20
#define CCU41_IN2_CCU41_ST3                	15
#define CCU41_IN2_ERU0_IOUT2               	10
#define CCU41_IN2_ERU0_PDOUT2              	9
#define CCU41_IN2_ERU0_PDOUT3              	3
#define CCU41_IN2_ERU1_IOUT2               	23
#define CCU41_IN2_ERU1_PDOUT2              	22
#define CCU41_IN2_ERU1_PDOUT3              	24
#define CCU41_IN2_P0_6                     	1
#define CCU41_IN2_P3_0                     	0
#define CCU41_IN2_P4_6                     	21
#define CCU41_IN2_SCU_GSC40                	8
#define CCU41_IN3_CCU40_ST3                	11
#define CCU41_IN3_CCU41_SR1                	19
#define CCU41_IN3_CCU41_SR3                	27
#define CCU41_IN3_CCU41_ST0                	13
#define CCU41_IN3_CCU41_ST1                	14
#define CCU41_IN3_CCU41_ST2                	15
#define CCU41_IN3_CCU41_ST3                	20
#define CCU41_IN3_ERU0_IOUT3               	10
#define CCU41_IN3_ERU0_PDOUT2              	3
#define CCU41_IN3_ERU0_PDOUT3              	9
#define CCU41_IN3_ERU1_IOUT3               	23
#define CCU41_IN3_ERU1_PDOUT2              	24
#define CCU41_IN3_ERU1_PDOUT3              	22
#define CCU41_IN3_P0_7                     	1
#define CCU41_IN3_P3_0                     	0
#define CCU41_IN3_P4_7                     	21
#define CCU41_IN3_SCU_GSC40                	8
#define CCU41_IN3_VADC0_G0ARBCNT           	6
#endif


#if (UC_DEVICE == XMC1403) && (UC_PACKAGE == VQFN64)
#define CCU40_IN0_CCU40_GP01               	12
#define CCU40_IN0_CCU40_SR0                	27
#define CCU40_IN0_CCU40_SR2                	19
#define CCU40_IN0_CCU40_ST0                	20
#define CCU40_IN0_CCU40_ST1                	13
#define CCU40_IN0_CCU40_ST2                	14
#define CCU40_IN0_CCU40_ST3                	15
#define CCU40_IN0_ERU0_IOUT0               	10
#define CCU40_IN0_ERU0_PDOUT0              	9
#define CCU40_IN0_ERU0_PDOUT1              	3
#define CCU40_IN0_ERU1_IOUT0               	23
#define CCU40_IN0_ERU1_PDOUT0              	22
#define CCU40_IN0_ERU1_PDOUT1              	24
#define CCU40_IN0_P0_0                     	2
#define CCU40_IN0_P0_12                    	0
#define CCU40_IN0_P0_6                     	1
#define CCU40_IN0_P4_0                     	26
#define CCU40_IN0_P4_8                     	21
#define CCU40_IN0_SCU_GSC40                	8
#define CCU40_IN0_U0C0_DX2INS              	11
#define CCU40_IN1_CCU40_GP02               	12
#define CCU40_IN1_CCU40_SR1                	27
#define CCU40_IN1_CCU40_SR2                	19
#define CCU40_IN1_CCU40_ST0                	13
#define CCU40_IN1_CCU40_ST1                	20
#define CCU40_IN1_CCU40_ST2                	14
#define CCU40_IN1_CCU40_ST3                	15
#define CCU40_IN1_ERU0_IOUT1               	10
#define CCU40_IN1_ERU0_PDOUT0              	3
#define CCU40_IN1_ERU0_PDOUT1              	9
#define CCU40_IN1_ERU1_IOUT1               	23
#define CCU40_IN1_ERU1_PDOUT0              	24
#define CCU40_IN1_ERU1_PDOUT1              	22
#define CCU40_IN1_P0_1                     	2
#define CCU40_IN1_P0_12                    	0
#define CCU40_IN1_P0_7                     	1
#define CCU40_IN1_P4_1                     	26
#define CCU40_IN1_P4_9                     	21
#define CCU40_IN1_SCU_GSC40                	8
#define CCU40_IN1_U0C1_DX2INS              	11
#define CCU40_IN2_CCU40_GP03               	12
#define CCU40_IN2_CCU40_SR1                	19
#define CCU40_IN2_CCU40_SR2                	27
#define CCU40_IN2_CCU40_ST0                	13
#define CCU40_IN2_CCU40_ST1                	14
#define CCU40_IN2_CCU40_ST2                	20
#define CCU40_IN2_CCU40_ST3                	15
#define CCU40_IN2_ERU0_IOUT2               	10
#define CCU40_IN2_ERU0_PDOUT2              	9
#define CCU40_IN2_ERU0_PDOUT3              	3
#define CCU40_IN2_ERU1_IOUT2               	23
#define CCU40_IN2_ERU1_PDOUT2              	22
#define CCU40_IN2_ERU1_PDOUT3              	24
#define CCU40_IN2_P0_12                    	0
#define CCU40_IN2_P0_2                     	2
#define CCU40_IN2_P0_8                     	1
#define CCU40_IN2_P4_10                    	21
#define CCU40_IN2_P4_2                     	26
#define CCU40_IN2_SCU_GSC40                	8
#define CCU40_IN3_CCU40_GP00               	12
#define CCU40_IN3_CCU40_SR1                	19
#define CCU40_IN3_CCU40_SR3                	27
#define CCU40_IN3_CCU40_ST0                	13
#define CCU40_IN3_CCU40_ST1                	14
#define CCU40_IN3_CCU40_ST2                	15
#define CCU40_IN3_CCU40_ST3                	20
#define CCU40_IN3_ERU0_IOUT3               	10
#define CCU40_IN3_ERU0_PDOUT2              	3
#define CCU40_IN3_ERU0_PDOUT3              	9
#define CCU40_IN3_ERU1_IOUT3               	23
#define CCU40_IN3_ERU1_PDOUT2              	24
#define CCU40_IN3_ERU1_PDOUT3              	22
#define CCU40_IN3_P0_12                    	0
#define CCU40_IN3_P0_3                     	2
#define CCU40_IN3_P0_9                     	1
#define CCU40_IN3_P4_11                    	21
#define CCU40_IN3_P4_3                     	26
#define CCU40_IN3_SCU_GSC40                	8
#define CCU40_IN3_VADC0_G0ARBCNT           	6
#define CCU41_IN0_CCU41_GP01               	12
#define CCU41_IN0_CCU41_SR0                	27
#define CCU41_IN0_CCU41_SR2                	19
#define CCU41_IN0_CCU41_ST0                	20
#define CCU41_IN0_CCU41_ST1                	13
#define CCU41_IN0_CCU41_ST2                	14
#define CCU41_IN0_CCU41_ST3                	15
#define CCU41_IN0_ERU0_IOUT0               	10
#define CCU41_IN0_ERU0_PDOUT0              	9
#define CCU41_IN0_ERU0_PDOUT1              	3
#define CCU41_IN0_ERU1_IOUT0               	23
#define CCU41_IN0_ERU1_PDOUT0              	22
#define CCU41_IN0_ERU1_PDOUT1              	24
#define CCU41_IN0_P0_4                     	1
#define CCU41_IN0_P3_0                     	0
#define CCU41_IN0_P4_0                     	2
#define CCU41_IN0_P4_4                     	21
#define CCU41_IN0_P4_8                     	26
#define CCU41_IN0_SCU_GSC40                	8
#define CCU41_IN0_U1C0_DX2INS              	28
#define CCU41_IN1_CCU40_ST1                	11
#define CCU41_IN1_CCU41_GP02               	12
#define CCU41_IN1_CCU41_SR1                	27
#define CCU41_IN1_CCU41_SR2                	19
#define CCU41_IN1_CCU41_ST0                	13
#define CCU41_IN1_CCU41_ST1                	20
#define CCU41_IN1_CCU41_ST2                	14
#define CCU41_IN1_CCU41_ST3                	15
#define CCU41_IN1_ERU0_IOUT1               	10
#define CCU41_IN1_ERU0_PDOUT0              	3
#define CCU41_IN1_ERU0_PDOUT1              	9
#define CCU41_IN1_ERU1_IOUT1               	23
#define CCU41_IN1_ERU1_PDOUT0              	24
#define CCU41_IN1_ERU1_PDOUT1              	22
#define CCU41_IN1_P0_5                     	1
#define CCU41_IN1_P3_0                     	0
#define CCU41_IN1_P4_1                     	2
#define CCU41_IN1_P4_5                     	21
#define CCU41_IN1_P4_9                     	26
#define CCU41_IN1_SCU_GSC40                	8
#define CCU41_IN1_U1C1_DX2INS              	28
#define CCU41_IN2_CCU40_ST2                	11
#define CCU41_IN2_CCU41_GP03               	12
#define CCU41_IN2_CCU41_SR1                	19
#define CCU41_IN2_CCU41_SR2                	27
#define CCU41_IN2_CCU41_ST0                	13
#define CCU41_IN2_CCU41_ST1                	14
#define CCU41_IN2_CCU41_ST2                	20
#define CCU41_IN2_CCU41_ST3                	15
#define CCU41_IN2_ERU0_IOUT2               	10
#define CCU41_IN2_ERU0_PDOUT2              	9
#define CCU41_IN2_ERU0_PDOUT3              	3
#define CCU41_IN2_ERU1_IOUT2               	23
#define CCU41_IN2_ERU1_PDOUT2              	22
#define CCU41_IN2_ERU1_PDOUT3              	24
#define CCU41_IN2_P0_6                     	1
#define CCU41_IN2_P3_0                     	0
#define CCU41_IN2_P4_10                    	26
#define CCU41_IN2_P4_2                     	2
#define CCU41_IN2_P4_6                     	21
#define CCU41_IN2_SCU_GSC40                	8
#define CCU41_IN3_CCU40_ST3                	11
#define CCU41_IN3_CCU41_SR1                	19
#define CCU41_IN3_CCU41_SR3                	27
#define CCU41_IN3_CCU41_ST0                	13
#define CCU41_IN3_CCU41_ST1                	14
#define CCU41_IN3_CCU41_ST2                	15
#define CCU41_IN3_CCU41_ST3                	20
#define CCU41_IN3_ERU0_IOUT3               	10
#define CCU41_IN3_ERU0_PDOUT2              	3
#define CCU41_IN3_ERU0_PDOUT3              	9
#define CCU41_IN3_ERU1_IOUT3               	23
#define CCU41_IN3_ERU1_PDOUT2              	24
#define CCU41_IN3_ERU1_PDOUT3              	22
#define CCU41_IN3_P0_7                     	1
#define CCU41_IN3_P3_0                     	0
#define CCU41_IN3_P4_11                    	26
#define CCU41_IN3_P4_3                     	2
#define CCU41_IN3_P4_7                     	21
#define CCU41_IN3_SCU_GSC40                	8
#define CCU41_IN3_VADC0_G0ARBCNT           	6
#endif


